---
type: ExportPDFSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# ExportPDFSettings

`Autodesk.Revit.DB.ExportPDFSettings` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2022 | `public static ExportPDFSettings Create ( Document document , string name , PDFExportOptions options )` |
| Method | FindByName | 2022 | `public static ExportPDFSettings FindByName ( Document document , string name )` |
| Method | GetActivePredefinedSettings | 2022 | `public static ExportPDFSettings GetActivePredefinedSettings ( Document document )` |
| Method | GetOptions | 2022 | `public PDFExportOptions GetOptions ()` |
| Method | IsValidName | 2022 | `public static bool IsValidName ( Document document , string name )` |
| Method | ListNames | 2022 | `public static IList < string > ListNames ( Document document )` |
| Method | SetOptions | 2022 | `public void SetOptions ( PDFExportOptions options )` |
| Property | Parameter | — | `` |